tests/data/callback-partial-payment.json

{
    "type": "SALE",
    "amount": "6.00",
    "status": "APPROVED",
    "orderID": "32456428",
    "currency": "USD",
    "extraData": {
        "dcc": false,
        "amountChanged": true,
        "paymentMethod": "CRYPTO",
        "originalAmount": "100.00"
    },
    "signature": "4256b13bd6664a11ab289ba1e69148d6d385ec429ad62ab15359644db7bd5b98",
    "endpointID": "400371",
    "customParam": "",
    "errorMessage": "",
    "customerEmail": "customer-d664@test-5e5f.com",
    "merchantOrderID": "15d95624501b",
    "originalRequest": {
    	"signature": "008c42310b171c16bfa063a6473fb6fe4d9d711776f1722ee1847119da8c3338",
    	"customerIP": "127.0.0.1",
    	"callbackUrl": "https://secure.zotapay-stage.com/api/v1/deposit/init/32456423/6109b59b27ce258d75b3b02aefffeb0fcf7762c269d0ac066203aee72259f3b2/",
    	"checkoutUrl": "https://vt.zotapay.com/",
    	"orderAmount": "100.00",
    	"redirectUrl": "https://admin.zotapay-stage.com/",
    	"requestedAt": "0001-01-01T00:00:00Z",
    	"customerCity": "Thong Nai Pan Noi",
    	"customerEmail": "customer-d664@test-5e5f.com",
    	"customerPhone": "66-77-916220",
    	"orderCurrency": "USD","customerAddress": "The Swan, Jungle St. 108",
    	"customerZipCode": "84280",
    	"merchantOrderID": "15d95624501b",
    	"customerLastName": "Doe",
    	"customerFirstName": "John",
    	"merchantOrderDesc": "Order description",
    	"customerCountryCode": "TH"
    }
}
